app/Controllers/Articles.php

    public function index()
    {
        $data = $this->model
                     ->select("article.*, users.first_name")
                     ->join("users", "users.id = article.users_id")
                     ->findAll();
---
SELECT `article`.*, `users`.`first_name`
FROM `article`
JOIN `users` ON `users`.`id` = `article`.`users_id`